Terraform plan for __ibo__
<details>
<summary>Plan: 7 to add, 0 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_address.istio_ingress_ip must be replaced
-/+ resource "google_compute_address" "istio_ingress_ip" {
      ~ address            = "34.93.55.246" -> (known after apply)
      ~ creation_timestamp = "2021-10-30T05:34:37.252-07:00" -> (known after apply)
      ~ id                 = "*********************************************************************" -> (known after apply)
      ~ name               = "production-cluster-ip" -> "prod-cluster-ip" # forces replacement
      ~ network_tier       = "PREMIUM" -> (known after apply)
      - prefix_length      = 0 -> null
      ~ project            = "ibo-prod" -> (known after apply)
      + purpose            = (known after apply)
      ~ region             = "asia-south1" -> (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/ibo-prod/regions/asia-south1/addresses/production-cluster-ip" -> (known after apply)
      + subnetwork         = (known after apply)
      ~ users              = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_storage_bucket.customer_file_bucket will be created
  + resource "google_storage_bucket" "customer_file_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "customer-support-files-prod"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket.invoice_file_bucket will be created
  + resource "google_storage_bucket" "invoice_file_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "invoice-file-upload-prod"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.customer_service_account_iam will be created
  + resource "google_storage_bucket_iam_member" "customer_service_account_iam" {
      + bucket = "customer-support-files-prod"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:customer-support-files@ibo-prod.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.invoice_service_account_iam will be created
  + resource "google_storage_bucket_iam_member" "invoice_service_account_iam" {
      + bucket = "invoice-file-upload-prod"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:invoice-file-upload@ibo-prod.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_object.deployment_service_account_key_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "deployment_service_account_key_bucket_object" {
      - cache_control       = "" -> null
      - content_disposition = "" -> null
      - content_encoding    = "" -> null
      - content_language    = "" -> null
      ~ content_type        = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c              = "9AYvJA==" -> (known after apply)
      ~ detect_md5hash      = "Mkv8Uf7flV/P4XzUXAyWXA==" -> "different hash"
      - event_based_hold    = false -> null
      ~ id                  = "**************************************" -> (known after apply)
      ~ kms_key_name        = "" -> (known after apply)
      ~ md5hash             = "Mkv8Uf7flV/P4XzUXAyWXA==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/ibo-prod/o/app-deployment-production.key?generation=1635597094207989&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "app-deployment-production.key" -> "app-deployment-prod.key" # forces replacement
      ~ output_name         = "app-deployment-production.key" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/ibo-prod/o/app-deployment-production.key" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.gke.google_container_node_pool.gke_cluster-nodepool must be replaced
-/+ resource "google_container_node_pool" "gke_cluster-nodepool" {
      ~ id                  = "**************************************************************************************************" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/ibo-prod/zones/asia-south1-a/instanceGroupManagers/gke-ebo-prod-gke-clu-ibo-prod-node-po-c63f2536-grp",
          - "https://www.googleapis.com/compute/v1/projects/ibo-prod/zones/asia-south1-b/instanceGroupManagers/gke-ebo-prod-gke-clu-ibo-prod-node-po-93d3a6b8-grp",
          - "https://www.googleapis.com/compute/v1/projects/ibo-prod/zones/asia-south1-c/instanceGroupManagers/gke-ebo-prod-gke-clu-ibo-prod-node-po-a073e650-grp",
        ] -> (known after apply)
        name                = "ibo-prod-node-pool"
      + name_prefix         = (known after apply)
      ~ node_locations      = [
          - "asia-south1-a",
          - "asia-south1-b",
          - "asia-south1-c",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.20.11-gke.1300" -> (known after apply)
        # (5 unchanged attributes hidden)



      ~ node_config {
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {
              ~ "environment" = "production" -> "prod"
                # (1 unchanged element hidden)
            }
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [ # forces replacement
              - "production",
              + "prod",
            ]
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 0 to change, 3 to destroy.
```
</details>

Plan generated in [Terraform #302](https://github.com/ebomart/commerce-infrastructure/actions/runs/1402407659)